[
    {
        "name": "Andrea Hsu",
        "date": "2023-09-20",
        "rating": 5,
        "content": "We just finished a 1-week free trial for kids and loved it. The instructors are great with children, playful and firm as needed. We liked it so much that we've invited the entire grade class to check it out! Thank you Freestyle Dojo!"
        
      },
      {
        "name": "Daniel Williams",
        "date": "2023-08-27",
        "rating": 5,
        "content": "My favourite place to train BJJ in Toronto. Freestyle has a refreshing combination of regular classes AND opportunities for self-directed drilling, the latter of which is often neglected at many Jiu Jitsu gyms around the city.\nThe facility is very clean and thoughtfully put together, with lots of brand new equipment; Freestyle easily has one of the best mat-spaces in Toronto.\nI feel like the personal attention and dedication from both Mike and Jesse has allowed me to learn new techniques, and progress faster than at other gyms I have previously trained at. I feel like I am able to get a private-lesson's worth of knowledge every time I stop by for class."
      },
      {
        "name": "Xavier Francis",
        "date": "2023-08-20",
        "rating": 5,
        "content": "The atmosphere, people, facilities and instructors can compete with any Jiu Jitsu gyms in the GTA. Both Mike and Jesse deliver clear and precise instructions that allowed me to learn very quickly. Both Instructors showed as much knowledge as any coach I have ever been taught by to date. It is definitely worth going in for a free Thursday Open Mat, to experience the amazing environment Mike and Jesse have created at Freestyle Dojo. Though I travel often, whenever I am in Toronto I will always stop by Freestyle Dojo for some Jiu Jitsu."
        
      },
      {
        "name": "Dusan Slepcev",
        "date": "2023-05-08",
        "rating": 5,
        "content": "If you’re looking to join a gym, this is the place to be! Mike and Jesse are amazing instructors that will provide you with elite level coaching. Every time I drop by, I get surprised by how many new things I learn from positions I thought I understood well. Their ability to explain complicated movements in a way that seems so simple is second to none. Pair that with the amazing atmosphere they strive to create, and you have one of the best gyms in the GTA!"
        
      },
      {
        "name": "June Wang",
        "date": "2023-05-07",
        "rating": 5,
        "content": "Did a trial week here, the place is clean, people are nice and respectful. Jesse is very patient, and professional. He explains concepts really well and break down the steps for you. Jujitsu is technical so a good teacher is very essential. They are very nice and inclusive to beginners as well. Would recommend if you are curious."
      },
      {
        "name": "Blake Sing",
        "date": "2023-05-01",
        "rating": 5,
        "content": "Starting a martial art and walking into a gym or dojo can be extremely intimidating. From the moment you step into Freestyle, the students are welcoming and always help new members feel comfortable and safe. Freestyle does not subscribe to the rigid formalities of traditional gyms, instead, the culture of this gym is about having fun and sharing knowledge and skills. Whether you've never stepped on a mat or you are an ADCC Champion, you'll benefit from the classes and the rolls. Head coach Mike is extremely knowledgable and his passion is contagious!"
      }
  ]
  